callwilliam66/ATF_NXP_Z_MD/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/***********************************************************************************************************************
 * Definitions
 **********************************************************************************************************************/

/*! @brief Direction type  */
typedef enum _pin_mux_direction
{
  kPIN_MUX_DirectionInput = 0U,         /* Input direction */
  kPIN_MUX_DirectionOutput = 1U,        /* Output direction */
  kPIN_MUX_DirectionInputOrOutput = 2U  /* Input or output direction */
} pin_mux_direction_t;

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define BOARD_INITPINS_IOMUXC_GPR_GPR26_GPIO_MUX1_GPIO_SEL_MASK 0x100030U /*!< GPIO1 and GPIO6 share same IO MUX function, GPIO_MUX1 selects one GPIO function: affected bits mask */
#define BOARD_INITPINS_IOMUXC_GPR_GPR27_GPIO_MUX2_GPIO_SEL_MASK 0xAFC00000U /*!< GPIO2 and GPIO7 share same IO MUX function, GPIO_MUX2 selects one GPIO function: affected bits mask */
#define BOARD_INITPINS_IOMUXC_GPR_GPR28_GPIO_MUX3_GPIO_SEL_MASK 0x0E100000U /*!< GPIO3 and GPIO8 share same IO MUX function, GPIO_MUX3 selects one GPIO function: affected bits mask */
#define BOARD_INITPINS_IOMUXC_GPR_GPR29_GPIO_MUX4_GPIO_SEL_MASK 0x8C000008U /*!< GPIO4 and GPIO9 share same IO MUX function, GPIO_MUX4 selects one GPIO function: affected bits mask */

/* GPIO_EMC_34 (coord D4), DO_0 */
/* Routed pin properties */
#define BOARD_INITPINS_DO_0_PERIPHERAL                                     GPIO3   /*!< Peripheral name */
#define BOARD_INITPINS_DO_0_SIGNAL                                       gpio_io   /*!< Signal name */
#define BOARD_INITPINS_DO_0_CHANNEL                                          20U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_DO_0_GPIO                                           GPIO3   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_DO_0_GPIO_PIN                                         20U   /*!< GPIO pin number */
#define BOARD_INITPINS_DO_0_GPIO_PIN_MASK                            (1U << 20U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_DO_0_PORT                                           GPIO3   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_DO_0_PIN                                              20U   /*!< PORT pin number */
#define BOARD_INITPINS_DO_0_PIN_MASK                                 (1U << 20U)   /*!< PORT pin mask */

/* GPIO_SD_B0_00 (coord J4), PWM_UH */
/* Routed pin properties */
#define BOARD_INITPINS_PWM_UH_PERIPHERAL                                    PWM1   /*!< Peripheral name */
#define BOARD_INITPINS_PWM_UH_SIGNAL                                           A   /*!< Signal name */
#define BOARD_INITPINS_PWM_UH_CHANNEL                                         0U   /*!< Signal channel */

/* GPIO_SD_B0_01 (coord J3), PWM_UL */
/* Routed pin properties */
#define BOARD_INITPINS_PWM_UL_PERIPHERAL                                    PWM1   /*!< Peripheral name */
#define BOARD_INITPINS_PWM_UL_SIGNAL                                           B   /*!< Signal name */
#define BOARD_INITPINS_PWM_UL_CHANNEL                                         0U   /*!< Signal channel */

/* GPIO_SD_B0_02 (coord J1), PWM_VH */
/* Routed pin properties */
#define BOARD_INITPINS_PWM_VH_PERIPHERAL                                    PWM1   /*!< Peripheral name */
#define BOARD_INITPINS_PWM_VH_SIGNAL                                           A   /*!< Signal name */
#define BOARD_INITPINS_PWM_VH_CHANNEL                                         1U   /*!< Signal channel */

/* GPIO_SD_B0_03 (coord K1), PWM_VL */
/* Routed pin properties */
#define BOARD_INITPINS_PWM_VL_PERIPHERAL                                    PWM1   /*!< Peripheral name */
#define BOARD_INITPINS_PWM_VL_SIGNAL                                           B   /*!< Signal name */
#define BOARD_INITPINS_PWM_VL_CHANNEL                                         1U   /*!< Signal channel */

/* GPIO_SD_B0_04 (coord H2), PWM_WH */
/* Routed pin properties */
#define BOARD_INITPINS_PWM_WH_PERIPHERAL                                    PWM1   /*!< Peripheral name */
#define BOARD_INITPINS_PWM_WH_SIGNAL                                           A   /*!< Signal name */
#define BOARD_INITPINS_PWM_WH_CHANNEL                                         2U   /*!< Signal channel */

/* GPIO_SD_B0_05 (coord J2), PWM_WL */
/* Routed pin properties */
#define BOARD_INITPINS_PWM_WL_PERIPHERAL                                    PWM1   /*!< Peripheral name */
#define BOARD_INITPINS_PWM_WL_SIGNAL                                           B   /*!< Signal name */
#define BOARD_INITPINS_PWM_WL_CHANNEL                                         2U   /*!< Signal channel */

/* GPIO_AD_B1_08 (coord H13), CUR_U */
/* Routed pin properties */
#define BOARD_INITPINS_CUR_U_PERIPHERAL                                     ADC1   /*!< Peripheral name */
#define BOARD_INITPINS_CUR_U_SIGNAL                                           IN   /*!< Signal name */
#define BOARD_INITPINS_CUR_U_CHANNEL                                         13U   /*!< Signal channel */

/* GPIO_AD_B0_14 (coord H14), CUR_V */
/* Routed pin properties */
#define BOARD_INITPINS_CUR_V_PERIPHERAL                                     ADC1   /*!< Peripheral name */
#define BOARD_INITPINS_CUR_V_SIGNAL                                           IN   /*!< Signal name */
#define BOARD_INITPINS_CUR_V_CHANNEL                                          3U   /*!< Signal channel */

/* GPIO_AD_B1_15 (coord J14), CUR_W */
/* Routed pin properties */
#define BOARD_INITPINS_CUR_W_PERIPHERAL                                     ADC2   /*!< Peripheral name */
#define BOARD_INITPINS_CUR_W_SIGNAL                                           IN   /*!< Signal name */
#define BOARD_INITPINS_CUR_W_CHANNEL                                          4U   /*!< Signal channel */

