callwilliam66/ATF_NXP_Z_MD/board/pin_mux.h
/* GPIO_AD_B1_06 (coord J12), VOLT_BUS */
/* Routed pin properties */
#define BOARD_INITPINS_VOLT_BUS_PERIPHERAL                                  ADC1   /*!< Peripheral name */
#define BOARD_INITPINS_VOLT_BUS_SIGNAL                                        IN   /*!< Signal name */
#define BOARD_INITPINS_VOLT_BUS_CHANNEL                                      11U   /*!< Signal channel */

/* GPIO_AD_B1_11 (coord J13), CUR_BUS */
/* Routed pin properties */
#define BOARD_INITPINS_CUR_BUS_OC_CMP_PERIPHERAL                            CMP1   /*!< Peripheral name */
#define BOARD_INITPINS_CUR_BUS_OC_CMP_SIGNAL                                  IN   /*!< Signal name */
#define BOARD_INITPINS_CUR_BUS_OC_CMP_CHANNEL                                 6U   /*!< Signal channel */

/* GPIO_EMC_40 (coord A7), DIN_1 */
/* Routed pin properties */
#define BOARD_INITPINS_DIN_1_PERIPHERAL                                    GPIO3   /*!< Peripheral name */
#define BOARD_INITPINS_DIN_1_SIGNAL                                      gpio_io   /*!< Signal name */
#define BOARD_INITPINS_DIN_1_CHANNEL                                         26U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_DIN_1_GPIO                                          GPIO3   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_DIN_1_GPIO_PIN                                        26U   /*!< GPIO pin number */
#define BOARD_INITPINS_DIN_1_GPIO_PIN_MASK                           (1U << 26U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_DIN_1_PORT                                          GPIO3   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_DIN_1_PIN                                             26U   /*!< PORT pin number */
#define BOARD_INITPINS_DIN_1_PIN_MASK                                (1U << 26U)   /*!< PORT pin mask */

/* GPIO_EMC_41 (coord C7), DIN_2 */
/* Routed pin properties */
#define BOARD_INITPINS_DIN_2_PERIPHERAL                                    GPIO3   /*!< Peripheral name */
#define BOARD_INITPINS_DIN_2_SIGNAL                                      gpio_io   /*!< Signal name */
#define BOARD_INITPINS_DIN_2_CHANNEL                                         27U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_DIN_2_GPIO                                          GPIO3   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_DIN_2_GPIO_PIN                                        27U   /*!< GPIO pin number */
#define BOARD_INITPINS_DIN_2_GPIO_PIN_MASK                           (1U << 27U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_DIN_2_PORT                                          GPIO3   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_DIN_2_PIN                                             27U   /*!< PORT pin number */
#define BOARD_INITPINS_DIN_2_PIN_MASK                                (1U << 27U)   /*!< PORT pin mask */

/* GPIO_AD_B0_04 (coord F11), MCU_BOOT0 */
/* Routed pin properties */
#define BOARD_INITPINS_MCU_BOOT0_PERIPHERAL                                GPIO1   /*!< Peripheral name */
#define BOARD_INITPINS_MCU_BOOT0_SIGNAL                                  gpio_io   /*!< Signal name */
#define BOARD_INITPINS_MCU_BOOT0_CHANNEL                                      4U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_MCU_BOOT0_GPIO                                      GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_MCU_BOOT0_GPIO_PIN                                     4U   /*!< GPIO pin number */
#define BOARD_INITPINS_MCU_BOOT0_GPIO_PIN_MASK                        (1U << 4U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_MCU_BOOT0_PORT                                      GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_MCU_BOOT0_PIN                                          4U   /*!< PORT pin number */
#define BOARD_INITPINS_MCU_BOOT0_PIN_MASK                             (1U << 4U)   /*!< PORT pin mask */

/* GPIO_AD_B0_05 (coord G14), MCU_BOOT1 */
/* Routed pin properties */
#define BOARD_INITPINS_MCU_BOOT1_PERIPHERAL                                GPIO1   /*!< Peripheral name */
#define BOARD_INITPINS_MCU_BOOT1_SIGNAL                                  gpio_io   /*!< Signal name */
#define BOARD_INITPINS_MCU_BOOT1_CHANNEL                                      5U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_MCU_BOOT1_GPIO                                      GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_MCU_BOOT1_GPIO_PIN                                     5U   /*!< GPIO pin number */
#define BOARD_INITPINS_MCU_BOOT1_GPIO_PIN_MASK                        (1U << 5U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_MCU_BOOT1_PORT                                      GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_MCU_BOOT1_PIN                                          5U   /*!< PORT pin number */
#define BOARD_INITPINS_MCU_BOOT1_PIN_MASK                             (1U << 5U)   /*!< PORT pin mask */

/* GPIO_EMC_00 (coord E3), ENC_ANGLE_B_POS_B */
/* Routed pin properties */
#define BOARD_INITPINS_ENC_ANGLE_B_PERIPHERAL                               ENC1   /*!< Peripheral name */
#define BOARD_INITPINS_ENC_ANGLE_B_SIGNAL                                  PHASE   /*!< Signal name */
#define BOARD_INITPINS_ENC_ANGLE_B_CHANNEL                                     A   /*!< Signal channel */

/* GPIO_EMC_01 (coord F3), ENC_ANGLE_A_POS_A */
/* Routed pin properties */
#define BOARD_INITPINS_ENC_ANGLE_A_PERIPHERAL                               ENC1   /*!< Peripheral name */
#define BOARD_INITPINS_ENC_ANGLE_A_SIGNAL                                  PHASE   /*!< Signal name */
#define BOARD_INITPINS_ENC_ANGLE_A_CHANNEL                                     B   /*!< Signal channel */

/* GPIO_EMC_00 (coord E3), ENC_ANGLE_B_POS_B */
/* Routed pin properties */
#define BOARD_INITPINS_ENC_POS_B_PERIPHERAL                                 ENC2   /*!< Peripheral name */
#define BOARD_INITPINS_ENC_POS_B_SIGNAL                                    PHASE   /*!< Signal name */
#define BOARD_INITPINS_ENC_POS_B_CHANNEL                                       A   /*!< Signal channel */

/* GPIO_EMC_01 (coord F3), ENC_ANGLE_A_POS_A */
/* Routed pin properties */
#define BOARD_INITPINS_ENC_POS_A_PERIPHERAL                                 ENC2   /*!< Peripheral name */
#define BOARD_INITPINS_ENC_POS_A_SIGNAL                                    PHASE   /*!< Signal name */
#define BOARD_INITPINS_ENC_POS_A_CHANNEL                                       B   /*!< Signal channel */

/* GPIO_B1_15 (coord B14), LD_ENABLE */
/* Routed pin properties */
#define BOARD_INITPINS_LD_ENABLE_PERIPHERAL                                GPIO2   /*!< Peripheral name */
#define BOARD_INITPINS_LD_ENABLE_SIGNAL                                  gpio_io   /*!< Signal name */
#define BOARD_INITPINS_LD_ENABLE_CHANNEL                                     31U   /*!< Signal channel */

