callwilliam66/ATF_NXP_Z_MD/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LD_ENABLE_GPIO                                      GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_LD_ENABLE_GPIO_PIN                                    31U   /*!< GPIO pin number */
#define BOARD_INITPINS_LD_ENABLE_GPIO_PIN_MASK                       (1U << 31U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_LD_ENABLE_PORT                                      GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_LD_ENABLE_PIN                                         31U   /*!< PORT pin number */
#define BOARD_INITPINS_LD_ENABLE_PIN_MASK                            (1U << 31U)   /*!< PORT pin mask */

/* GPIO_AD_B0_12 (coord K14), USB_UART_TX */
/* Routed pin properties */
#define BOARD_INITPINS_USB_UART_TX_PERIPHERAL                            LPUART1   /*!< Peripheral name */
#define BOARD_INITPINS_USB_UART_TX_SIGNAL                                     TX   /*!< Signal name */

/* GPIO_AD_B0_13 (coord L14), USB_UART_RX */
/* Routed pin properties */
#define BOARD_INITPINS_USB_UART_RX_PERIPHERAL                            LPUART1   /*!< Peripheral name */
#define BOARD_INITPINS_USB_UART_RX_SIGNAL                                     RX   /*!< Signal name */

/* GPIO_EMC_03 (coord G4), ENC_V */
/* Routed pin properties */
#define BOARD_INITPINS_ENC_V_PERIPHERAL                                    GPIO4   /*!< Peripheral name */
#define BOARD_INITPINS_ENC_V_SIGNAL                                      gpio_io   /*!< Signal name */
#define BOARD_INITPINS_ENC_V_CHANNEL                                          3U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_ENC_V_GPIO                                          GPIO4   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_ENC_V_GPIO_PIN                                         3U   /*!< GPIO pin number */
#define BOARD_INITPINS_ENC_V_GPIO_PIN_MASK                            (1U << 3U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_ENC_V_PORT                                          GPIO4   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_ENC_V_PIN                                              3U   /*!< PORT pin number */
#define BOARD_INITPINS_ENC_V_PIN_MASK                                 (1U << 3U)   /*!< PORT pin mask */

/* GPIO_AD_B1_07 (coord K10), SYS_TEMP */
/* Routed pin properties */
#define BOARD_INITPINS_SYS_TEMP_PERIPHERAL                                  ADC1   /*!< Peripheral name */
#define BOARD_INITPINS_SYS_TEMP_SIGNAL                                        IN   /*!< Signal name */
#define BOARD_INITPINS_SYS_TEMP_CHANNEL                                      12U   /*!< Signal channel */

/* GPIO_B1_11 (coord C13), ENC_EN */
/* Routed pin properties */
#define BOARD_INITPINS_ENC_EN_PERIPHERAL                                   GPIO2   /*!< Peripheral name */
#define BOARD_INITPINS_ENC_EN_SIGNAL                                     gpio_io   /*!< Signal name */
#define BOARD_INITPINS_ENC_EN_CHANNEL                                        27U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_ENC_EN_GPIO                                         GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_ENC_EN_GPIO_PIN                                       27U   /*!< GPIO pin number */
#define BOARD_INITPINS_ENC_EN_GPIO_PIN_MASK                          (1U << 27U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_ENC_EN_PORT                                         GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_ENC_EN_PIN                                            27U   /*!< PORT pin number */
#define BOARD_INITPINS_ENC_EN_PIN_MASK                               (1U << 27U)   /*!< PORT pin mask */

/* GPIO_B1_13 (coord D14), LD_STB */
/* Routed pin properties */
#define BOARD_INITPINS_LD_STB_PERIPHERAL                                   GPIO2   /*!< Peripheral name */
#define BOARD_INITPINS_LD_STB_SIGNAL                                     gpio_io   /*!< Signal name */
#define BOARD_INITPINS_LD_STB_CHANNEL                                        29U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LD_STB_GPIO                                         GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_LD_STB_GPIO_PIN                                       29U   /*!< GPIO pin number */
#define BOARD_INITPINS_LD_STB_GPIO_PIN_MASK                          (1U << 29U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_LD_STB_PORT                                         GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_LD_STB_PIN                                            29U   /*!< PORT pin number */
#define BOARD_INITPINS_LD_STB_PIN_MASK                               (1U << 29U)   /*!< PORT pin mask */

/* GPIO_EMC_27 (coord A2), LED_RED */
/* Routed pin properties */
#define BOARD_INITPINS_LED_RED_PERIPHERAL                                  GPIO4   /*!< Peripheral name */
#define BOARD_INITPINS_LED_RED_SIGNAL                                    gpio_io   /*!< Signal name */
#define BOARD_INITPINS_LED_RED_CHANNEL                                       27U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LED_RED_GPIO                                        GPIO4   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_LED_RED_GPIO_PIN                                      27U   /*!< GPIO pin number */
#define BOARD_INITPINS_LED_RED_GPIO_PIN_MASK                         (1U << 27U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_LED_RED_PORT                                        GPIO4   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_LED_RED_PIN                                           27U   /*!< PORT pin number */
#define BOARD_INITPINS_LED_RED_PIN_MASK                              (1U << 27U)   /*!< PORT pin mask */

/* GPIO_EMC_14 (coord B6), RS422_UART_RX */
/* Routed pin properties */
#define BOARD_INITPINS_RS422_UART_RX_PERIPHERAL                          LPUART3   /*!< Peripheral name */
#define BOARD_INITPINS_RS422_UART_RX_SIGNAL                                   RX   /*!< Signal name */

