callwilliam66/ATF_NXP_Z_MD/board/pin_mux.h
/* GPIO_EMC_13 (coord A6), RS422_UART_TX */
/* Routed pin properties */
#define BOARD_INITPINS_RS422_UART_TX_PERIPHERAL                          LPUART3   /*!< Peripheral name */
#define BOARD_INITPINS_RS422_UART_TX_SIGNAL                                   TX   /*!< Signal name */

/* GPIO_EMC_04 (coord F2), ENC_ANGLE_Z */
/* Routed pin properties */
#define BOARD_INITPINS_ENC_ANGLE_Z_PERIPHERAL                               ENC1   /*!< Peripheral name */
#define BOARD_INITPINS_ENC_ANGLE_Z_SIGNAL                                  INDEX   /*!< Signal name */

/* GPIO_EMC_19 (coord B4), UART4_TX */
/* Routed pin properties */
#define BOARD_INITPINS_UART4_TX_PERIPHERAL                               LPUART4   /*!< Peripheral name */
#define BOARD_INITPINS_UART4_TX_SIGNAL                                        TX   /*!< Signal name */

/* GPIO_EMC_20 (coord A3), UART4_RX */
/* Routed pin properties */
#define BOARD_INITPINS_UART4_RX_PERIPHERAL                               LPUART4   /*!< Peripheral name */
#define BOARD_INITPINS_UART4_RX_SIGNAL                                        RX   /*!< Signal name */

/* GPIO_EMC_39 (coord B7), DIN_0 */
/* Routed pin properties */
#define BOARD_INITPINS_DIN_0_PERIPHERAL                                    GPIO3   /*!< Peripheral name */
#define BOARD_INITPINS_DIN_0_SIGNAL                                      gpio_io   /*!< Signal name */
#define BOARD_INITPINS_DIN_0_CHANNEL                                         25U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_DIN_0_GPIO                                          GPIO3   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_DIN_0_GPIO_PIN                                        25U   /*!< GPIO pin number */
#define BOARD_INITPINS_DIN_0_GPIO_PIN_MASK                           (1U << 25U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_DIN_0_PORT                                          GPIO3   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_DIN_0_PIN                                             25U   /*!< PORT pin number */
#define BOARD_INITPINS_DIN_0_PIN_MASK                                (1U << 25U)   /*!< PORT pin mask */

/* GPIO_EMC_26 (coord B3), LED_G */
/* Routed pin properties */
#define BOARD_INITPINS_LED_G_PERIPHERAL                                    GPIO4   /*!< Peripheral name */
#define BOARD_INITPINS_LED_G_SIGNAL                                      gpio_io   /*!< Signal name */
#define BOARD_INITPINS_LED_G_CHANNEL                                         26U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LED_G_GPIO                                          GPIO4   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_LED_G_GPIO_PIN                                        26U   /*!< GPIO pin number */
#define BOARD_INITPINS_LED_G_GPIO_PIN_MASK                           (1U << 26U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_LED_G_PORT                                          GPIO4   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_LED_G_PIN                                             26U   /*!< PORT pin number */
#define BOARD_INITPINS_LED_G_PIN_MASK                                (1U << 26U)   /*!< PORT pin mask */

/* GPIO_B1_14 (coord C14), Light_PWM */
/* Routed pin properties */
#define BOARD_INITPINS_Light_PWM_PERIPHERAL                                 PWM4   /*!< Peripheral name */
#define BOARD_INITPINS_Light_PWM_SIGNAL                                        A   /*!< Signal name */
#define BOARD_INITPINS_Light_PWM_CHANNEL                                      2U   /*!< Signal channel */

/* GPIO_AD_B1_13 (coord H11), Light_V_Out */
/* Routed pin properties */
#define BOARD_INITPINS_Light_V_Out_PERIPHERAL                               ADC2   /*!< Peripheral name */
#define BOARD_INITPINS_Light_V_Out_SIGNAL                                     IN   /*!< Signal name */
#define BOARD_INITPINS_Light_V_Out_CHANNEL                                    2U   /*!< Signal channel */

/* GPIO_EMC_31 (coord C5), DI_A */
/* Routed pin properties */
#define BOARD_INITPINS_DI_A_PERIPHERAL                                     GPIO4   /*!< Peripheral name */
#define BOARD_INITPINS_DI_A_SIGNAL                                       gpio_io   /*!< Signal name */
#define BOARD_INITPINS_DI_A_CHANNEL                                          31U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_DI_A_GPIO                                           GPIO4   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_DI_A_GPIO_PIN                                         31U   /*!< GPIO pin number */
#define BOARD_INITPINS_DI_A_GPIO_PIN_MASK                            (1U << 31U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_DI_A_PORT                                           GPIO4   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_DI_A_PIN                                              31U   /*!< PORT pin number */
#define BOARD_INITPINS_DI_A_PIN_MASK                                 (1U << 31U)   /*!< PORT pin mask */

/* GPIO_B1_06 (coord C12), HSIO3 */
/* Routed pin properties */
#define BOARD_INITPINS_HSIO3_PERIPHERAL                                    GPIO2   /*!< Peripheral name */
#define BOARD_INITPINS_HSIO3_SIGNAL                                      gpio_io   /*!< Signal name */
#define BOARD_INITPINS_HSIO3_CHANNEL                                         22U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_HSIO3_GPIO                                          GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_HSIO3_GPIO_PIN                                        22U   /*!< GPIO pin number */
#define BOARD_INITPINS_HSIO3_GPIO_PIN_MASK                           (1U << 22U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_HSIO3_PORT                                          GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_HSIO3_PIN                                             22U   /*!< PORT pin number */
#define BOARD_INITPINS_HSIO3_PIN_MASK                                (1U << 22U)   /*!< PORT pin mask */

/* GPIO_B1_07 (coord B12), HSIO1 */
/* Routed pin properties */
#define BOARD_INITPINS_HSIO1_PERIPHERAL                                    GPIO2   /*!< Peripheral name */
#define BOARD_INITPINS_HSIO1_SIGNAL                                      gpio_io   /*!< Signal name */
#define BOARD_INITPINS_HSIO1_CHANNEL                                         23U   /*!< Signal channel */

