callwilliam66/ATF_NXP_Z_MD/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_HSIO1_GPIO                                          GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_HSIO1_GPIO_PIN                                        23U   /*!< GPIO pin number */
#define BOARD_INITPINS_HSIO1_GPIO_PIN_MASK                           (1U << 23U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_HSIO1_PORT                                          GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_HSIO1_PIN                                             23U   /*!< PORT pin number */
#define BOARD_INITPINS_HSIO1_PIN_MASK                                (1U << 23U)   /*!< PORT pin mask */

/* GPIO_B1_08 (coord A12), HSIO2 */
/* Routed pin properties */
#define BOARD_INITPINS_HSIO2_PERIPHERAL                                    GPIO2   /*!< Peripheral name */
#define BOARD_INITPINS_HSIO2_SIGNAL                                      gpio_io   /*!< Signal name */
#define BOARD_INITPINS_HSIO2_CHANNEL                                         24U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_HSIO2_GPIO                                          GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_HSIO2_GPIO_PIN                                        24U   /*!< GPIO pin number */
#define BOARD_INITPINS_HSIO2_GPIO_PIN_MASK                           (1U << 24U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_HSIO2_PORT                                          GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_HSIO2_PIN                                             24U   /*!< PORT pin number */
#define BOARD_INITPINS_HSIO2_PIN_MASK                                (1U << 24U)   /*!< PORT pin mask */

/* GPIO_B1_09 (coord A13), HSIO4 */
/* Routed pin properties */
#define BOARD_INITPINS_HSIO4_PERIPHERAL                                    GPIO2   /*!< Peripheral name */
#define BOARD_INITPINS_HSIO4_SIGNAL                                      gpio_io   /*!< Signal name */
#define BOARD_INITPINS_HSIO4_CHANNEL                                         25U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_HSIO4_GPIO                                          GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_HSIO4_GPIO_PIN                                        25U   /*!< GPIO pin number */
#define BOARD_INITPINS_HSIO4_GPIO_PIN_MASK                           (1U << 25U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_HSIO4_PORT                                          GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_HSIO4_PIN                                             25U   /*!< PORT pin number */
#define BOARD_INITPINS_HSIO4_PIN_MASK                                (1U << 25U)   /*!< PORT pin mask */

/* GPIO_B1_10 (coord B13), HSIO5 */
/* Routed pin properties */
#define BOARD_INITPINS_HSIO5_PERIPHERAL                                    GPIO2   /*!< Peripheral name */
#define BOARD_INITPINS_HSIO5_SIGNAL                                      gpio_io   /*!< Signal name */
#define BOARD_INITPINS_HSIO5_CHANNEL                                         26U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_HSIO5_GPIO                                          GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_HSIO5_GPIO_PIN                                        26U   /*!< GPIO pin number */
#define BOARD_INITPINS_HSIO5_GPIO_PIN_MASK                           (1U << 26U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_HSIO5_PORT                                          GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_HSIO5_PIN                                             26U   /*!< PORT pin number */
#define BOARD_INITPINS_HSIO5_PIN_MASK                                (1U << 26U)   /*!< PORT pin mask */

/* GPIO_AD_B1_04 (coord L12), UART2_SEL */
/* Routed pin properties */
#define BOARD_INITPINS_UART2_SEL_PERIPHERAL                                GPIO1   /*!< Peripheral name */
#define BOARD_INITPINS_UART2_SEL_SIGNAL                                  gpio_io   /*!< Signal name */
#define BOARD_INITPINS_UART2_SEL_CHANNEL                                     20U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_UART2_SEL_GPIO                                      GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_UART2_SEL_GPIO_PIN                                    20U   /*!< GPIO pin number */
#define BOARD_INITPINS_UART2_SEL_GPIO_PIN_MASK                       (1U << 20U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_UART2_SEL_PORT                                      GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_UART2_SEL_PIN                                         20U   /*!< PORT pin number */
#define BOARD_INITPINS_UART2_SEL_PIN_MASK                            (1U << 20U)   /*!< PORT pin mask */

/* GPIO_AD_B1_02 (coord L11), UART2_TX */
/* Routed pin properties */
#define BOARD_INITPINS_UART2_TX_PERIPHERAL                               LPUART2   /*!< Peripheral name */
#define BOARD_INITPINS_UART2_TX_SIGNAL                                        TX   /*!< Signal name */

/* GPIO_AD_B1_03 (coord M12), UART2_RX */
/* Routed pin properties */
#define BOARD_INITPINS_UART2_RX_PERIPHERAL                               LPUART2   /*!< Peripheral name */
#define BOARD_INITPINS_UART2_RX_SIGNAL                                        RX   /*!< Signal name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
